---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AlignmentService
source: html/981a7fce-11a4-9898-c9f9-2e860c4e7f64.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AlignmentService Property

Autodesk Internal: The service for Infrastructure Alignments

## Syntax (C#)
```csharp
public static ExternalServiceId AlignmentService { get; }
```